tiborsimon/embedded-tdd-headers/pic/8bit/pic18lf2550_tdd.h
#define RX9D                          522
#define OERR                          523
#define FERR                          524
#define ADDEN                         525
#define ADEN                          526
#define CREN                          527
#define SRENA                         528
#define SREN                          529
#define RC9                           530
#define RC8_9                         531
#define RX9                           532
#define SPEN                          533
#define TXSTA                         534
#define TXD8                          535
#define TX9D1                         536
#define TX9D                          537
#define TRMT                          538
#define TRMT1                         539
#define BRGH1                         540
#define BRGH                          541
#define SENDB1                        542
#define SENDB                         543
#define SYNC                          544
#define SYNC1                         545
#define TXEN1                         546
#define TXEN                          547
#define TX91                          548
#define TX8_9                         549
#define TX9                           550
#define CSRC1                         551
#define CSRC                          552
#define T3CON                         553
#define TMR3ON                        554
#define TMR3CS                        555
#define nT3SYNC                       556
#define T3NSYNC                       557
#define NOT_T3SYNC                    558
#define T3SYNC                        559
#define SOSCEN3                       560
#define T3CCP1                        561
#define T3CKPS                        562
#define T3CKPS0                       563
#define T3CKPS1                       564
#define T3CCP2                        565
#define T3CON_RD16                    566
#define RD163                         567
#define T3RD16                        568
#define CMCON                         569
#define CM                            570
#define CMEN0                         571
#define CM0                           572
#define CMEN1                         573
#define CM1                           574
#define CMEN2                         575
#define CM2                           576
#define CIS                           577
#define C1INV                         578
#define C2INV                         579
#define C1OUT                         580
#define C2OUT                         581
#define CVRCON                        582
#define CVR                           583
#define CVR0                          584
#define CVR1                          585
#define CVR2                          586
#define CVR3                          587
#define CVRSS                         588
#define CVREF                         589
#define CVRR                          590
#define CVROEN                        591
#define CVROE                         592
#define CVREN                         593
#define ECCP1AS                       594
#define PSSAC                         595
#define PSSAC0                        596
#define PSSAC1                        597
#define ECCPAS0                       598
#define ECCPAS                        599
#define ECCPAS1                       600
#define ECCPAS2                       601
#define ECCPASE                       602
#define ECCP1DEL                      603
#define PRSEN                         604
#define BAUDCON                       605
#define ABDEN                         606
#define W4E                           607
#define WUE                           608
#define BRG16                         609
#define TXCKP                         610
#define SCKP                          611
#define RXCKP                         612
#define RXDTP                         613
#define RCMT                          614
#define RCIDL                         615
#define ABDOVF                        616
#define CCP2CON                       617
#define CCP2M                         618
#define CCP2M0                        619
#define CCP2M1                        620
#define CCP2M2                        621
#define CCP2M3                        622
#define DC2B0                         623
#define DC2B                          624
#define DC2B1                         625
#define CCP1CON                       626
#define CCP1M0                        627
#define CCP1M                         628
#define CCP1M1                        629
#define CCP1M2                        630
#define CCP1M3                        631
#define DC1B                          632
#define DC1B0                         633
#define DC1B1                         634
#define ADCON2                        635
#define ADCS0                         636
#define ADCS                          637
#define ADCS1                         638
#define ADCS2                         639
#define ACQT0                         640
#define ACQT                          641
#define ACQT1                         642
#define ACQT2                         643
#define ADFM                          644
#define ADCON1                        645
#define PCFG0                         646
#define PCFG                          647
#define PCFG1                         648
#define PCFG2                         649
#define CHSN3                         650
#define PCFG3                         651
#define VCFG                          652
#define VCFG0                         653
#define VCFG01                        654
#define VCFG11                        655
#define VCFG1                         656
#define ADCON0                        657
#define ADON                          658
#define nDONE                         659
#define GO_nDONE                      660
#define NOT_DONE                      661
#define GODONE                        662
#define GO_DONE                       663
#define DONE                          664
#define GO_NOT_DONE                   665
#define GO                            666
#define CHS0                          667
#define CHS                           668
#define CHS1                          669
#define CHS2                          670
#define CHS3                          671
#define SSPCON2                       672
#define SEN                           673
#define RSEN                          674
#define PEN                           675
#define RCEN                          676
#define ACKEN                         677
#define ACKDT                         678
#define ACKSTAT                       679
#define GCEN                          680
#define SSPCON1                       681
#define SSPM0                         682
#define SSPM                          683
#define SSPM1                         684
#define SSPM2                         685
#define SSPM3                         686
#define CKP                           687
#define SSPEN                         688
#define SSPOV                         689
#define WCOL                          690
#define SSPSTAT                       691
#define BF                            692
#define UA                            693
#define R_NOT_W                       694
#define READ_WRITE                    695
#define NOT_W                         696
#define R_W                           697
#define nW                            698
#define RW                            699
#define nWRITE                        700
#define R                             701
#define NOT_WRITE                     702
#define R_nW                          703
#define I2C_READ                      704
#define START                         705
#define S                             706
#define I2C_START                     707
#define STOP                          708
#define I2C_STOP                      709
#define P                             710
#define NOT_A                         711
#define DATA_ADDRESS                  712
#define nA                            713
#define D_A                           714
#define D_nA                          715
#define D                             716
#define DA                            717
#define D_NOT_A                       718
#define NOT_ADDRESS                   719
#define nADDRESS                      720
#define I2C_DAT                       721
#define CKE                           722
#define SMP                           723
#define T2CON                         724
#define T2CKPS0                       725
#define T2CKPS                        726
#define T2CKPS1                       727
#define TMR2ON                        728
#define T2OUTPS0                      729
#define TOUTPS0                       730
#define TOUTPS                        731
#define T2OUTPS1                      732
#define TOUTPS1                       733
#define T2OUTPS2                      734
#define TOUTPS2                       735
#define T2OUTPS3                      736
#define TOUTPS3                       737
#define PR2                           738
#define WM0                           739
#define WM1                           740
#define WAIT0                         741
#define WAIT1                         742
#define EBDIS                         743
#define T1CON                         744
#define TMR1ON                        745
#define TMR1CS                        746
#define NOT_T1SYNC                    747
#define T1SYNC                        748
#define nT1SYNC                       749
#define T1OSCEN                       750
#define SOSCEN                        751
#define T1CKPS0                       752
#define T1CKPS                        753
#define T1CKPS1                       754
#define T1RUN                         755
#define T1CON_RD16                    756
#define T1RD16                        757
#define RCON                          758
#define BOR                           759
#define NOT_BOR                       760
#define nBOR                          761
#define POR                           762
#define nPOR                          763
#define NOT_POR                       764
#define PD                            765
#define nPD                           766
#define NOT_PD                        767
#define NOT_TO                        768
#define nTO                           769
#define TO                            770
#define nRI                           771
#define NOT_RI                        772
#define RI                            773
#define SBOREN                        774
#define nIPEN                         775
#define IPEN                          776
#define NOT_IPEN                      777
#define WDTCON                        778
#define SWDTE                         779
#define SWDTEN                        780
#define HLVDCON                       781
#define HLVDL                         782
#define HLVDL0                        783
#define LVV0                          784
#define LVDL0                         785
#define HLVDL1                        786
#define LVDL1                         787
#define LVV1                          788
#define HLVDL2                        789
#define LVV2                          790
#define LVDL2                         791
#define HLVDL3                        792
#define LVV3                          793
#define LVDL3                         794
#define HLVDEN                        795
#define LVDEN                         796
#define BGST                          797
#define IRVST                         798
#define IVRST                         799
#define VDIRMAG                       800
#define OSCCON                        801
#define SCS0                          802
#define SCS                           803
#define SCS1                          804
#define FLTS                          805
#define IOFS                          806
#define OSTS                          807
#define IRCF                          808
#define IRCF0                         809
#define IRCF1                         810
#define IRCF2                         811
#define IDLEN                         812
#define T0CON                         813
#define T0PS                          814
#define T0PS0                         815
#define T0PS1                         816
#define T0PS2                         817
#define PSA                           818
#define T0SE                          819
#define T0CS                          820
#define T08BIT                        821
#define TMR0ON                        822
#define STATUS                        823
#define C                             824
#define CARRY                         825
#define DC                            826
#define ZERO                          827
#define Z                             828
#define OV                            829
#define OVERFLOW                      830
#define N                             831
#define NEGATIVE                      832
#define INTCON3                       833
#define INT1IF                        834
#define INT1F                         835
#define INT2IF                        836
#define INT2F                         837
#define INT1E                         838
#define INT1IE                        839
#define INT2IE                        840
#define INT2E                         841
#define INT1P                         842
#define INT1IP                        843
#define INT2IP                        844
#define INT2P                         845
#define INTCON2                       846
#define RBIP                          847
#define TMR0IP                        848
#define T0IP                          849
#define INTEDG2                       850
#define INTEDG1                       851
#define INTEDG0                       852
#define RBPU                          853
#define NOT_RBPU                      854
#define nRBPU                         855
#define INTCON                        856
#define RBIF                          857
#define INT0F                         858
#define INT0IF                        859
#define T0IF                          860
#define TMR0IF                        861
#define RBIE                          862
#define INT0E                         863
#define INT0IE                        864
#define T0IE                          865
#define TMR0IE                        866
#define PEIE                          867
#define PEIE_GIEL                     868
#define GIEL                          869
#define GIE_GIEH                      870
#define GIE                           871
#define GIEH                          872
#define STKPTR0                       873
#define STKPTR                        874
#define STKPTR1                       875
#define STKPTR2                       876
#define STKPTR3                       877
#define STKPTR4                       878
#define STKUNF                        879
#define STKOVF                        880
#define STKFUL                        881

#endif // _PIC18LF2550_H_
